# IsNestedLink Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevitLinkType..::..IsNestedLink Property
RevitLinkType Class See Also
---
Indicates whether this link is a nested or top-level link.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsNestedLink { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsNestedLink As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsNestedLink {
	bool get ();
}
```

# See Also
RevitLinkType Class
Autodesk.Revit.DB Namespace